app/Controllers/DashboardController.php

    public function dataLapor()
    {
        $currentPage = $this->request->getVar('dataLapor') ? $this->request->getVar('dataLapor') : 1;

        $data = [
            'data' => $this->dashboardModels->paginate(10, 'data'), // Menampilkan 10 data per halaman
            'pager' => $this->dashboardModels->pager,
            'currentPage' => $currentPage
        ];
---
SELECT *
FROM `data`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `data`

    public function search()
    {
        $keyword = $this->request->getPost('keyword');
        $lapor = $this->dashboardModels->search($keyword);

        $data = [
            'data' => $lapor->getResult(), // Mengambil hasil pencarian
        ];
---
SELECT DATE_FORMAT(created_at, '%Y-%m') AS date, COUNT(*) AS total
FROM `data`
GROUP BY DATE_FORMAT(created_at, '%Y-%m')

    public function detail($id){
        $data['data'] = $this->laporModels->find($id);
---
SELECT *
FROM `data`
WHERE `data`.`id` = '2404-WBS-21-003'