app/Controllers/DashboardController.php

SELECT *
FROM `data`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `data`
---
    public function dataLapor()
    {
        $currentPage = $this->request->getVar('dataLapor') ? $this->request->getVar('dataLapor') : 1;

        $data = [
            'data' => $this->dashboardModels->paginate(10, 'data'), // Menampilkan 10 data per halaman
            'pager' => $this->dashboardModels->pager,
            'currentPage' => $currentPage
        ];

SELECT *
FROM `data`
WHERE `data`.`id` = '2404-WBS-11-003'
---
    public function edit($id){
        $data['data'] = $this->laporModels->find($id);