app/Controllers/LaporController.php

        ];
        //Simpan data ke dalam database menggunakan insertBatch()
        $db = \Config\Database::connect();
        $db->table('data')->insert($data);
---
INSERT INTO `data` (`id`, `sifat_pelapor`, `firstName`, `noIdentitas`, `jk`, `alamat`, `email`, `phone`, `jenisPelanggaran`, `firstNameTerlapor`, `divisi`, `departemen`, `waktu`, `lokasi`, `kronologi`, `nominalKerugian`, `dokumen`, `status`, `created_at`, `updated_at`) VALUES ('2403-wbs-21-002', 'Anonymous', ' ', NULL, 'Perempuan', 'n                      ', 'n@gmail.com', 'n', 'Fraud', 'n n', 'n', 'n', 'n', 'n', 'n                      ', 'n', '1711702264_3c3c5b51259958e83cb9.jpeg, 1711702264_8fcd319d59fc1c7eef89.jpeg', 'Sedang Ditinjau', '2024-03-29 08:51:04', '2024-03-29 08:51:04')