app/Controllers/LaporController.php

INSERT INTO `data` (`sifat_pelapor`, `firstName`, `noIdentitas`, `jk`, `alamat`, `email`, `phone`, `jenisPelanggaran`, `firstNameTerlapor`, `divisi`, `departemen`, `waktu`, `lokasi`, `kronologi`, `nominalKerugian`, `dokumen`) VALUES ('on', ' ', NULL, 'Perempuan', '              datata        ', 'data@gmail.com', '67890', 'Fraud', 'sads sas', 'fd', 'df', '23', 'dsds', '                      xxc', 'zzx', 'W2 Maret Dashboard Support (4).pdf')
---
            ];

            // Simpan data ke database
            if (!$this->laporModels->insert($data)) {