app/Models/LaporModels.php

    public function getMaxID()
    {
    return $this->db->table('data')->selectMax('id')->get()->getRowArray()['id'];
---
SELECT MAX(`id`) AS `id`
FROM `data`